logs/async/4/ab_results-async-50.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /async
Document Length:        144 bytes

Concurrency Level:      50
Time taken for tests:   0.268 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      388000 bytes
HTML transferred:       144000 bytes
Requests per second:    3733.67 [#/sec] (mean)
Time per request:       13.392 [ms] (mean)
Time per request:       0.268 [ms] (mean, across all concurrent requests)
Transfer rate:          1414.71 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      0       2
Processing:     5   12   4.5     11      31
Waiting:        4   10   3.7     10      26
Total:          5   13   4.7     12      32
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     13
  75%     14
  80%     15
  90%     17
  95%     28
  98%     30
  99%     30
 100%     32 (longest request)